# SetDashStyle

## Description
Procedure SetDashStyle creates a new linestyle in a VectorWorks document. Parameter swt defines whether the linestyle will be scaled with thickness, and parameter numPairs specifies the number of length pairs defining the linestyle.

The linestyle is defined by up to five black/white length pairs, which are specified in parameters pair1 through pair5. The minimum length of any given black or white parameter is 1 point, or 1/72 of an inch, and the line specification must be in pairs.

```pascal
PROCEDURE SetDashStyle(
				swt      : BOOLEAN;
				numPairs : INTEGER;
				pair1    : REAL;
				pair2    : REAL;
				pair3    : REAL;
				pair4    : REAL;
				pair5    : REAL);
```

```python
def vs.SetDashStyle(swt, numPairs, pair1, pair2, pair3, pair4, pair5):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|swt|BOOLEAN|   |
|numPairs|INTEGER|   |
|pair1|REAL|   |
|pair2|REAL|   |
|pair3|REAL|   |
|pair4|REAL|   |
|pair5|REAL|   |

## Remarks
\_c\_, (2014.04.08):  It creates a generically named dash style. Use SetDashStyleN to name the new style during creation. The dash-gap values must be in page inches. More comments on Vectorlab's [http://www.vectorlab.info/index.php?title=Index_pitfalls Index_pitfalls].

The routine can be expressed as below, whereby you'll only enter as many dashX-gapX values as needed:

```pascal
SetDashStyle(scalesWithThickness: BOOLEAN; numPairs: INTEGER; dash1, gap1, dash2, gap2, dash3, gap3, dash4, gap4, dash5, gap5: REAL);
```

## Examples
#### VectorScript ####
```pascal
SetDashStyle(True, 0,1",1 /4", 1/4", 1/4");
```
#### Python ####
```python

```

```pascal
-1:SetDashStyle(TRUE,1,0.041656,0.041656);
-2:SetDashStyle(TRUE,1,0.097214,0.041656);
-3:SetDashStyle(TRUE,1,0.12,0.03);
-4:SetDashStyle(TRUE,1,0.208328,0.041666);
-5:SetDashStyle(TRUE,1,0.005,0.03);

MoveTo(0,0);
LineTo(endLineLength,0);
SetDashStyle(TRUE,2,0.24,0.03,0.005,0.03); {ISO-4} {Automatically sets the current pen}
LineTo(rawLineLength-endLineLength,0);
PenPatN(2); {Solid}
LineTo(rawLineLength,0);

BEGIN
	SetDashStyle(TRUE, 2, .12, .03, .005, .03);
	lineStyle := FPenPatN;
	SetLSN(gParmH, lineStyle);
END;
```
```python
vs.SetDashStyle(swt, 1, pair1, pair2, pair3, pair4, pair5)
```

## Version
Availability: from MiniCAD 4.0

## Category
* Document Attributes